lkolbly/cmsis-svd/data/TexasInstruments/LM3S9U95.svd
        <register>
          <name>HB8CFG2</name>
          <description>EPI Host-Bus 8 Configuration 2</description>
          <alternateGroup>EPI_ALT8</alternateGroup>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8CFG2_RDWS</name>
              <description>CS1n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_0</name>
                  <description>No wait states</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_1</name>
                  <description>1 wait state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_2</name>
                  <description>2 wait states</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_3</name>
                  <description>3 wait states</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_WRWS</name>
              <description>CS1n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_0</name>
                  <description>No wait states</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_1</name>
                  <description>1 wait state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_2</name>
                  <description>2 wait states</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_3</name>
                  <description>3 wait states</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_RDHIGH</name>
              <description>CS1n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG2_WRHIGH</name>
              <description>CS1n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSCFG</name>
              <description>Chip Select Configuration</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_CS</name>
                  <description>CSn Configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSBAUD</name>
              <description>Chip Select Baud Rate</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG2_WORD</name>
              <description>Word Access Mode</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16CFG2</name>
          <description>EPI Host-Bus 16 Configuration 2</description>
          <alternateGroup>EPI_ALT16</alternateGroup>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16CFG2_RDWS</name>
              <description>CS1n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_0</name>
                  <description>No wait states</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_1</name>
                  <description>1 wait state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_2</name>
                  <description>2 wait states</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_3</name>
                  <description>3 wait states</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRWS</name>
              <description>CS1n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_0</name>
                  <description>No wait states</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_1</name>
                  <description>1 wait state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_2</name>
                  <description>2 wait states</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_3</name>
                  <description>3 wait states</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_RDHIGH</name>
              <description>CS1n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRHIGH</name>
              <description>CS1n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSCFG</name>
              <description>Chip Select Configuration</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_CS</name>
                  <description>CSn Configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSBAUD</name>
              <description>Chip Select Baud Rate</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_WORD</name>
              <description>Word Access Mode</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCFG2</name>
          <description>EPI General-Purpose Configuration 2</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EPI_GPCFG2_WORD</name>
              <description>Word Access Mode</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP</name>
          <description>EPI Address Map</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>EPI_ADDRMAP_ERADR</name>
              <description>External RAM Address</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_6000</name>
                  <description>At 0x6000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_8000</name>
                  <description>At 0x8000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ERSZ</name>
              <description>External RAM Size</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPADR</name>
              <description>External Peripheral Address</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_A000</name>
                  <description>At 0xA000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_C000</name>
                  <description>At 0xC000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPSZ</name>
              <description>External Peripheral Size</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE0</name>
          <description>EPI Read Size 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>EPI_RSIZE0_SIZE</name>
              <description>Current Size</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR0</name>
          <description>EPI Read Address 0</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>EPI_RADDR0_ADDR</name>
              <description>Current Address</description>
              <bitRange>[28:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD0</name>
          <description>EPI Non-Blocking Read Data 0</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>EPI_RPSTD0_POSTCNT</name>
              <description>Post Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE1</name>
          <description>EPI Read Size 1</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>EPI_RSIZE1_SIZE</name>
              <description>Current Size</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR1</name>
          <description>EPI Read Address 1</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>EPI_RADDR1_ADDR</name>
              <description>Current Address</description>
              <bitRange>[28:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD1</name>
          <description>EPI Non-Blocking Read Data 1</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>EPI_RPSTD1_POSTCNT</name>
              <description>Post Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>EPI Status</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>EPI_STAT_ACTIVE</name>
              <description>Register Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_NBRBUSY</name>
              <description>Non-Blocking Read Busy</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_WBUSY</name>
              <description>Write Busy</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_INITSEQ</name>
              <description>Initialization Sequence</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_XFEMPTY</name>
              <description>External FIFO Empty</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_XFFULL</name>
              <description>External FIFO Full</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_CELOW</name>
              <description>Clock Enable Low</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIFOCNT</name>
          <description>EPI Read FIFO Count</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>EPI_RFIFOCNT_COUNT</name>
              <description>FIFO Count</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO</name>
          <description>EPI Read FIFO</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO1</name>
          <description>EPI Read FIFO Alias 1</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO1_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO2</name>
          <description>EPI Read FIFO Alias 2</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO2_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO3</name>
          <description>EPI Read FIFO Alias 3</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO3_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO4</name>
          <description>EPI Read FIFO Alias 4</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO4_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO5</name>
          <description>EPI Read FIFO Alias 5</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO5_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO6</name>
          <description>EPI Read FIFO Alias 6</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO6_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO7</name>
          <description>EPI Read FIFO Alias 7</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO7_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
